Repository: bolelligallevi/thoth-omp-plugin
Catalog: locale/*/locale.po
Languages: es, it, pt_br

# plugins.generic.thoth.name
source: Thoth Plugin
es: Módulo Thoth
pt_br: Plugin Thoth

# plugins.generic.thoth.description
source: Integrate OMP with Thoth for communication and synchronization of book data between the two platforms.
es: Integrar OMP con Thoth para la comunicación y sincronización de los datos de los libros entre las dos plataformas.
it: Integra OMP con Thoth per la comunicazione e la sincronizzazione dei dati dei libri tra le due piattaforme.
pt_br: Integra o OMP com o Thoth para comunicação e sincronização de dados de livros entre as duas plataformas.

# plugins.generic.thoth.settings.title
source: Thoth API Settings
es: Configuración de la API de Thoth
it: Impostazioni API Thoth
pt_br: Configurações da API Thoth

# plugins.generic.thoth.settings.testEnvironment
source: Test Environment
es: Entorno de prueba
it: Ambiente di test
pt_br: Ambiente de testes

# plugins.generic.thoth.settings.testEnvironment.description
source: Check this option if you have a local instance of the Thoth API. (http://localhost:8000)
es: Marque esta opción si dispone de una instancia local de la API Thoth. (http://localhost:8000)
it: Selezionare questa opzione se si dispone di un'istanza locale dell'API Thoth. (http://localhost:8000)
pt_br: Marque essa opção caso possua uma instância local da API do Thoth. (http://localhost:8000)

# plugins.generic.thoth.settings.email
source: Email
es: Correo electrónico

# plugins.generic.thoth.settings.password
source: Password
es: Contraseña
pt_br: Senha

# plugins.generic.thoth.settings.invalidCredentials
source: Invalid credentials
es: Credenciales no válidas
it: Credenziali non valide
pt_br: Credenciais inválidas

# plugins.generic.thoth.settings.secretKeyEmpty
source: Your site administrator must set a secret in the config file ('api_key_secret').
es: El administrador de su sitio debe establecer un secreto en el archivo de configuración ('api_key_secret').
it: L'amministratore del sito deve impostare una chiave segreta nel file di configurazione (‘api_key_secret’).
pt_br: O administrador do seu site deve definir um segredo no arquivo de configuração ('api_key_secret').

# plugins.generic.thoth.credentialsMissing
source: Thoth credentials not configured.
es: Credenciales de Thoth no configuradas.
it: Credenziali Thoth non configurate.
pt_br: Credenciais do Thoth não configuradas.

# plugins.generic.thoth.workType
source: Work Type
es: Tipo de Trabajo
it: Tipo di opera

# plugins.generic.thoth.workType.monograph
source: Monograph
es: Monografía
it: Monografia

# plugins.generic.thoth.workType.textbook
source: Textbook
es: Libro de Texto

# plugins.generic.thoth.thothBook
source: Thoth Book:
es: Libro de Thoth:
it: Libro Thoth:
pt_br: Livro Thoth:

# plugins.generic.thoth.imprint
source: Imprint
es: Impresión
pt_br: Impressão

# plugins.generic.thoth.imprint.required
source: Select a imprint.
es: Seleccione una impresión.
it: Seleziona un imprint.
pt_br: Selecione uma impressão.

# plugins.generic.thoth.connectionError
source: There was a problem connecting to Thoth. Please try again later, or contact your system administrator.
es: Se ha producido un problema al conectar con Thoth. Vuelva a intentarlo más tarde o póngase en contacto con el administrador del sistema.
it: Si è verificato un problema durante la connessione a Thoth. Riprova più tardi o contatta l'amministratore di sistema.
pt_br: Houve um problema ao conectar-se com Thoth. Por favor, tente mais tarde, ou contate o administrador do sistema.

# plugins.generic.thoth.status.registered
source: Registered
es: Registrado
it: Registrato

# plugins.generic.thoth.status.unregistered
source: Unregistered
es: No Registrado
it: Non registrato

# plugins.generic.thoth.register
source: Register
es: Registrar
it: Registra
pt_br: Registrar

# plugins.generic.thoth.register.label
source: Thoth registration
es: Registro en Thoth
it: Registrazione in Thoth
pt_br: Registro em Thoth

# plugins.generic.thoth.register.warning
source: The submission metadata can not be submitted to Thoth because of the following errors:
es: Los metadatos de envio no pueden ser enviados a Thoth debido a los siguientes errores:
it: I metadati della proposta non possono essere inviati a Thoth a causa dei seguenti errori:
pt_br: Os metadados da submissão não podem ser enviados para Thoth devido aos seguintes erros:

# plugins.generic.thoth.validation.isbn
source: "{$isbn}" of "{$formatName}" publication format is not a valid ISBN-13. A valid ISBN-13 must be exactly 17 characters (numbers and hyphens).
es: "{$isbn}" del formato de publicación "{$formatName}" no es un ISBN-13 válido. Un ISBN-13 válido debe tener exactamente 17 caracteres (números y guiones).
it: "{$isbn}" del formato di pubblicazione "{$formatName}" non è un ISBN-13 valido.
pt_br: "{$isbn}" do formato de publicação "{$formatName}" não é um ISBN-13 válido. Um ISBN-13 válido deve ter exatamente 17 caracteres (números e hífens).

# plugins.generic.thoth.validation.doiExists
source: A work with DOI "{$doi}" already exists.
es: Un trabajo con el DOI "{$doi}" ya existe.
it: Esiste già un'opera con DOI "{$doi}".
pt_br: Um trabalho com o DOI "{$doi}" já existe.

# plugins.generic.thoth.validation.landingPageExists
source: A work with the landing page "{$landingPage}" already exists.
es: Un trabajo con la página de destino "{$landingPage}" ya existe.
it: Esiste già un'opera con la pagina di destinazione "{$landingPage}".
pt_br: Um trabalho com a página de destino "{$landingPage}" já existe.

# plugins.generic.thoth.validation.isbnExists
source: A publication with the ISBN "{$isbn}" already exists.
es: Una publicación con el ISBN "{$isbn}" ya existe.
it: Esiste già una pubblicazione con ISBN "{$isbn}".

# plugins.generic.thoth.register.confirmation
source: Do you want to register in Thoth the metadata related to this submission?
es: ¿Desea registrar en Thoth los metadatos relacionados con este envío?
it: Vuoi registrare in Thoth i metadati relativi a questa proposta?
pt_br: Deseja realmente registrar na Thoth os metadados relacionados a essa submissão?

# plugins.generic.thoth.register.success
source: Submission metadata successfully sent to Thoth.
es: Metadatos de envío enviados correctamente a Thoth.
it: Metadati della proposta inviati con successo a Thoth.
pt_br: Metadados da submissão enviados para Thoth com sucesso.

# plugins.generic.thoth.register.success.log
source: Submission metadata registered in Thoth.
es: Metadatos de envío registrados en Thoth.
it: Metadati della proposta registrati in Thoth.
pt_br: Metadados da submissão registrados no Thoth.

# plugins.generic.thoth.register.error
source: There was a problem sending the submission metadata to Thoth. Please try again later, or contact your system administrator.
es: Se ha producido un problema al enviar los metadatos de envío a Thoth. Vuelva a intentarlo más tarde o póngase en contacto con el administrador del sistema.
it: Si è verificato un problema durante l'invio dei metadati della proposta a Thoth. Riprova più tardi o contatta l'amministratore di sistema.
pt_br: Houve um problema ao enviar os metadados da submissão para Thoth. Por favor, tente mais tarde, ou contate o administrador do sistema.

# plugins.generic.thoth.register.error.log
source: Error registering metadata in Thoth: {$reason}
es: Error al registrar metadatos en Thoth: {$reason}
it: Errore durante la registrazione dei metadati in Thoth: {$reason}
pt_br: Erro ao registrar metadados no Thoth. Motivo: {$reason}

# plugins.generic.thoth.update
source: Update Metadata
es: Actualizar Metadatos
it: Aggiorna metadati
pt_br: Atualizar Metadados

# plugins.generic.thoth.update.success
source: Metadata successfully updated in Thoth.
es: Metadatos actualizados correctamente en Thoth.
it: Metadati aggiornati con successo in Thoth.
pt_br: Metadados atualizados com sucesso em Thoth.

# plugins.generic.thoth.update.success.log
source: Submission metadata updated in Thoth.
es: Metadatos actualizados en Thoth.
it: Metadati della proposta aggiornati in Thoth.
pt_br: Metadados da submissão atualizados no Thoth.

# plugins.generic.thoth.update.error
source: There was a problem updating metadata in Thoth. Please try again later, or contact your system administrator.
es: Se ha producido un problema al actualizar los metadatos en Thoth Vuelva a intentarlo más tarde o póngase en contacto con el administrador del sistema.
it: Si è verificato un problema durante l'aggiornamento dei metadati in Thoth. Riprova più tardi o contatta l'amministratore di sistema.
pt_br: Houve um problema ao atualizar os metadados em Thoth. Por favor, tente mais tarde, ou contate o administrador do sistema.

# plugins.generic.thoth.update.error.log
source: Error updating metadata in Thoth: {$reason}
es: Error al actualizar metadatos en Thoth: {$reason}
it: Errore durante l'aggiornamento dei metadati in Thoth: {$reason}
pt_br: Erro ao atualizar metadados no Thoth. Motivo: {$reason}

# plugins.generic.thoth.actions.register.label
source: Register Submissions
es: Registrar Envíos
it: Registra proposte

# plugins.generic.thoth.actions.register.prompt
source: You are about to send submission metadata for {$count} item(s) to Thoth. Are you sure you want to register these records?
es: Está a punto de enviar metadatos de envíos de {$count} elemento(s) a Thoth. ¿Está seguro de que desea registrar estos registros?
it: Stai per inviare i metadati della proposta per {$count} elementi a Thoth. Sei sicuro di voler registrare questi record?

# plugins.generic.thoth.api.403.alreadyRegistered
source: The submission is already registered in Thoth.
es: El envío ya está registrado en Thoth.
it: La proposta è già registrata in Thoth.
pt_br: A submissão já foi registrada na Thoth.

# plugins.generic.thoth.field.place.label
source: Place of Publication
it: Luogo di pubblicazione

# plugins.generic.thoth.field.pageCount.label
source: Page Count
it: Numero di pagine

# plugins.generic.thoth.field.imageCount.label
source: Image Count
it: Numero di immagini
